In [3]:
import numpy as np
import pandas as pd

# Import SQL Alchemy
from sqlalchemy import create_engine

# Get the username and password from config file
# from config import username, password

import requests
import os
import seaborn as sns
from psycopg2.extensions import register_adapter, AsIs

# Import API key
# from config import yelp_api_key

# GeoPandas
# import geopandas as gpd
# from shapely.geometry import Point, Polygon

import matplotlib
import matplotlib.pyplot as plt

In [2]:
# Instead of running the cell below to import final tables using pandas read_csv, you can run this cell.
# %run Extract.ipynb
# %run Transform.ipynb

In [4]:
# final transformed restaurant table
restaurant_transformed = pd.read_csv('clean_data/restaurant.csv')
restaurant_transformed = restaurant_transformed.set_index('restaurant_id')

# final transformed neighbourhood_restaurant table
neighbourhood_restaurant_transformed = pd.read_csv('clean_data/neighbourhood_restaurant.csv')
neighbourhood_restaurant_transformed = neighbourhood_restaurant_transformed.set_index('neighbourhood_id')

# final transformed neighbourhood table
neighbourhood_transformed = pd.read_csv('clean_data/neighbourhood.csv')
neighbourhood_transformed = neighbourhood_transformed.set_index('neighbourhood_id')

# final ethnicity transformed table
ethnicity_transformed = pd.read_csv('clean_data/ethnicity.csv')
ethnicity_transformed = ethnicity_transformed.set_index('neighbourhood_id')

# final income transformed table
income_transformed = pd.read_csv('clean_data/income.csv')
income_transformed = income_transformed.set_index('neighbourhood_id')

# final crime transformed table
crime_transformed = pd.read_csv('clean_data/crime.csv')
crime_transformed = crime_transformed.set_index('neighbourhood_id')

# final yelp ratings table
yelp_rating_transformed = pd.read_csv('clean_data/yelp_ratings.csv')
yelp_rating_transformed = yelp_rating_transformed.set_index('restaurant_id')

### Table 1) Final Transformed Income Data

In [4]:
income_transformed.head()

,neighbourhood_name,median_income,average_income
neighbourhood_id,,,
1,West Humber-Clairville,66241.0,76228.0
2,Mount Olive-Silverstone-Jamestown,49934.0,58605.0
3,Thistletown-Beaumond Heights,62042.0,73512.0
4,Rexdale-Kipling,56545.0,66781.0
5,Elms-Old Rexdale,50846.0,63201.0

### Table 2) Final Transformed Neighbourhood Data

In [5]:
neighbourhood_transformed

                                 neighbourhood_name
neighbourhood_id
1                            West Humber-Clairville
2                 Mount Olive-Silverstone-Jamestown
3                      Thistletown-Beaumond Heights
4                                   Rexdale-Kipling
5                                  Elms-Old Rexdale
...                                             ...
136                                       West Hill
137                                          Woburn
138                                   Eglinton East
139                             Scarborough Village
140                                       Guildwood

[140 rows x 1 columns]

### Table 3) Final Transformed Crime Data

In [6]:
crime_transformed.head()

                                 neighbourhood_name  total_average_crime_rate
neighbourhood_id
1                            West Humber-Clairville                    507.32
2                 Mount Olive-Silverstone-Jamestown                    232.13
3                      Thistletown-Beaumond Heights                    236.50
4                                   Rexdale-Kipling                    245.35
5                                  Elms-Old Rexdale                    216.80

### Table 4) Final Transformed Ethnicity Data

In [7]:
ethnicity_transformed.head()

,neighbourhood_name,oceania_origins,asian_origins,north_american_aboriginal_origins,other_north_american_origins,latin_origins,european_origins,african_origins,caribbean_origins
neighbourhood_id,,,,,,,,,
129,Agincourt North,10,24305,40,1345,470,3055,535,1445
128,Agincourt South-Malvern West,0,17955,105,1190,480,3770,625,1395
20,Alderwood,0,2055,305,2355,315,9135,215,350
95,Annex,140,6485,475,5255,765,21055,1040,750
42,Banbury-Don Mills,20,12025,230,3230,585,13435,990,815

### Table 5) Final Transformed Restaurant Data

In [8]:
restaurant_transformed.head()

,category,restaurant_name,price_range,latitude,longitude,neighbourhood_id,neighbourhood_name
restaurant_id,,,,,,,
1,Afghan,The Host,$11-30,43.669935,-79.395858,95,annex
2,Afghan,Aanch Modernist Indian Cuisine,$11-30,43.644708,-79.390670,77,waterfront communities-the island
3,Afghan,Silk Road Kabob House,Under $10,43.659816,-79.385591,76,bay street corridor
4,Afghan,Naan & Kabob,$11-30,43.669058,-79.386100,75,church-yonge corridor
5,Afghan,Afghan Cuisine,$11-30,43.708070,-79.341508,55,thorncliffe park

### Table 6) Final Transformed Neighbourhood_Restaurant Data

In [9]:
neighbourhood_restaurant_transformed.head()

                                 neighbourhood_name  number_of_restaurants
neighbourhood_id
76                              bay street corridor                    355
77                waterfront communities-the island                    354
78                             kensington-chinatown                    280
75                            church-yonge corridor                    214
95                                            annex                    180

### Table 7) Final Transformed Yelp Ratings Data

In [10]:
yelp_rating_transformed.head()

,restaurant_name,category,ratings,review_counts,zip_code
restaurant_id,,,,,
e41TP5cXZqSrz50xCBJqZw,Insomnia Restaurant & Lounge,Lounges,4.0,923,M5S 1Y6
r_BrIgzYcwo1NAuG9dLbpg,Pai Northern Thai Kitchen,Thai,4.5,2895,M5H 3G8
Uq-GOs9_IqweUsB5MdII9w,Emma's Country Kitchen,Breakfast & Brunch,4.0,394,M6C 1B6
iGEvDk6hsizigmXhDKs2Vg,Seven Lives Tacos y Mariscos,Mexican,4.5,1323,M5T 2K1
-ICGmF2qUVKdvOehVNgPbg,Lamesa Filipino Kitchen,Filipino,4.0,352,M6C 1A9

### Create database connection to Neighborhoods_DB

In [12]:
# # Establish Connection to neighborhood database
# engine = create_engine('postgres://ssbhhlzo:ml3hJfrli7AgJRwhxx_nIHmSITfYYTz4@ziggy.db.elephantsql.com:5432/ssbhhlzo')
# conn = engine.connect()

In [5]:
engine = create_engine('postgres://njvrdjyvjmdbff:8574a3313def94cb7b048ef3496350a723d4ebcbb2ae1a709d66a79eab0112fe@ec2-54-211-77-238.compute-1.amazonaws.com:5432/d7ne1s21u49i5u')
conn = engine.connect()

In [6]:
# Confirm tables
engine.table_names()

[]

In [7]:
# Function to solve the error, ProgrammingError: (psycopg2.ProgrammingError) can't adapt type 'numpy.int64'
def adapt_numpy_int64(np_int64):
    return AsIs(np_int64)

register_adapter(np.int64, adapt_numpy_int64)

### Load DataFrames into database

In [8]:
neighbourhood_transformed.to_sql(name='neighbourhood', con=engine, if_exists='replace', index=True)

In [9]:
income_transformed.to_sql(name='income', con=engine, if_exists='replace', index=True)

In [10]:
crime_transformed.to_sql(name='crime', con=engine, if_exists='replace', index=True)

In [11]:
ethnicity_transformed.to_sql(name='ethnicity', con=engine, if_exists='replace', index=True)

In [12]:
restaurant_transformed.to_sql(name='restaurant', con=engine, if_exists='replace', index=True)

In [14]:
neighbourhood_restaurant_transformed.to_sql(name='neighbourhood_restaurant', con=engine, if_exists='replace', index=True, method='multi')

In [13]:
engine.execute('ALTER TABLE neighbourhood ADD PRIMARY KEY (neighbourhood_id);')

In [15]:
engine.execute('ALTER TABLE income ADD PRIMARY KEY (neighbourhood_id);')

In [16]:
engine.execute('ALTER TABLE crime ADD PRIMARY KEY (neighbourhood_id);')

In [17]:
engine.execute('ALTER TABLE ethnicity ADD PRIMARY KEY (neighbourhood_id);')

In [18]:
engine.execute('ALTER TABLE restaurant ADD PRIMARY KEY (restaurant_id);')

In [19]:
engine.execute('ALTER TABLE neighbourhood_restaurant ADD PRIMARY KEY (neighbourhood_id);')

### View Table data in Pandas

In [22]:
Neighbourhood_records = pd.read_sql("SELECT * FROM neighbourhood" , conn) 
print (f'Data in Neighbourhood table\n--------------------------------------\n{Neighbourhood_records.head(10)}')

Data in Neighbourhood table
--------------------------------------
   neighbourhood_id                 neighbourhood_name
0                 1             West Humber-Clairville
1                 2  Mount Olive-Silverstone-Jamestown
2                 3       Thistletown-Beaumond Heights
3                 4                    Rexdale-Kipling
4                 5                   Elms-Old Rexdale
5                 6      Kingsview Village-The Westway
6                 7   Willowridge-Martingrove-Richview
7                 8           Humber Heights-Westmount
8                 9           Edenbridge-Humber Valley
9                10                 Princess-Rosethorn

In [23]:
Income_records = pd.read_sql("SELECT * FROM income" , conn) 
print (f'Data in Income table\n--------------------------------------\n{Income_records.head(10)}')

Data in Income table
--------------------------------------
   neighbourhood_id                 neighbourhood_name  median_income  \
0                 1             West Humber-Clairville        66241.0
1                 2  Mount Olive-Silverstone-Jamestown        49934.0
2                 3       Thistletown-Beaumond Heights        62042.0
3                 4                    Rexdale-Kipling        56545.0
4                 5                   Elms-Old Rexdale        50846.0
5                 6      Kingsview Village-The Westway        55454.0
6                 7   Willowridge-Martingrove-Richview        63701.0
7                 8           Humber Heights-Westmount        60410.0
8                 9           Edenbridge-Humber Valley        71646.0
9                10                 Princess-Rosethorn       114844.0

   average_income
0         76228.0
1         58605.0
2         73512.0
3         66781.0
4         63201.0
5         71539.0
6         81035.0
7         81291.0
8        126895.0
9        174858.0

In [24]:
Crime_records = pd.read_sql("SELECT * FROM crime" , conn) 
print (f'Data in Crime table\n--------------------------------------\n{Crime_records.head(10)}')

Data in Crime table
--------------------------------------
   neighbourhood_id                 neighbourhood_name  \
0                 1             West Humber-Clairville
1                 2  Mount Olive-Silverstone-Jamestown
2                 3       Thistletown-Beaumond Heights
3                 4                    Rexdale-Kipling
4                 5                   Elms-Old Rexdale
5                 6      Kingsview Village-The Westway
6                 7   Willowridge-Martingrove-Richview
7                 8           Humber Heights-Westmount
8                 9           Edenbridge-Humber Valley
9                10                 Princess-Rosethorn

   total_average_crime_rate
0                    507.32
1                    232.13
2                    236.50
3                    245.35
4                    216.80
5                    131.05
6                    163.98
7                    123.32
8                    131.97
9                    162.87

In [25]:
Ethnicity_records = pd.read_sql("SELECT * FROM ethnicity" , conn) 
print (f'Data in Ethnicity table\n--------------------------------------\n{Ethnicity_records.head(10)}')

Data in Ethnicity table
--------------------------------------
   neighbourhood_id            neighbourhood_name  oceania_origins  \
0               129               Agincourt North               10
1               128  Agincourt South-Malvern West                0
2                20                     Alderwood                0
3                95                         Annex              140
4                42             Banbury-Don Mills               20
5                34                Bathurst Manor                0
6                76           Bay Street Corridor               60
7                52               Bayview Village               45
8                49         Bayview Woods-Steeles               15
9                39          Bedford Park-Nortown               50

   asian_origins  north_american_aboriginal_origins  \
0          24305                                 40
1          17955                                105
2           2055                                305
3           6485                                475
4          12025                                230
5           5190                                 90
6          15040                                250
7          13845                                110
8           7920                                110
9           5210                                100

   other_north_american_origins  latin_origins  european_origins  \
0                          1345            470              3055
1                          1190            480              3770
2                          2355            315              9135
3                          5255            765             21055
4                          3230            585             13435
5                          1630            670              9370
6                          2445            720              9360
7                          1450            585              6645
8                           920            300              4255
9                          4940            520             16150

   african_origins  caribbean_origins
0              535               1445
1              625               1395
2              215                350
3             1040                750
4              990                815
5              600                440
6             1135                510
7              640                570
8              415                510
9              625                330

In [28]:
Restaurant_records = pd.read_sql("SELECT * FROM restaurant" , conn) 
print (f'Data in Restaurant table\n--------------------------------------\n{Restaurant_records.head(10)}')

Data in Restaurant table
--------------------------------------
   restaurant_id category                 restaurant_name price_range  \
0              1   Afghan                        The Host      $11-30
1              2   Afghan  Aanch Modernist Indian Cuisine      $11-30
2              3   Afghan           Silk Road Kabob House   Under $10
3              4   Afghan                    Naan & Kabob      $11-30
4              5   Afghan                  Afghan Cuisine      $11-30
5              6   Afghan                    Pamier Kabob      $11-30
6              7   Afghan                   Bamiyan Kabob      $11-30
7              8   Afghan                  Kandahar Kabab      $11-30
8              9   Afghan            Afghan Kebob Cuisine   Under $10
9             10   Afghan                   Bamiyan Kabob      $11-30

    latitude  longitude  neighbourhood_id                 neighbourhood_name
0  43.669935 -79.395858                95                              annex
1  43.644708 -79.390670                77  waterfront communities-the island
2  43.659816 -79.385591                76                bay street corridor
3  43.669058 -79.386100                75              church-yonge corridor
4  43.708070 -79.341508                55                   thorncliffe park
5  43.647210 -79.395473                77  waterfront communities-the island
6  43.773829 -79.492068                27            york university heights
7  43.812544 -79.242368               132                            malvern
8  43.716049 -79.555686                 4                    rexdale-kipling
9  43.707861 -79.343364                55                   thorncliffe park

In [29]:
Neighbourhood_Restaurant_records = pd.read_sql("SELECT * FROM neighbourhood_restaurant" , conn) 
print (f'Data in Neighbourhood Restaurant table\n--------------------------------------\n{Neighbourhood_Restaurant_records.head(10)}')

Data in Neighbourhood Restaurant table
--------------------------------------
   neighbourhood_id                 neighbourhood_name  number_of_restaurants
0                76                bay street corridor                    355
1                77  waterfront communities-the island                    354
2                78               kensington-chinatown                    280
3                75              church-yonge corridor                    214
4                95                              annex                    180
5                81                  trinity-bellwoods                    136
6                14         islington-city centre west                    120
7                70                    south riverdale                    106
8               130                           milliken                     97
9                80            palmerston-little italy                     91

In [30]:
Yelp_Ratings_records = pd.read_sql("SELECT * FROM yelp_ratings" , conn) 
print (f'Data in Yelp Ratings table\n--------------------------------------\n{Yelp_Ratings_records.head(10)}')

Data in Yelp Ratings table
--------------------------------------
            restaurant_id         restaurant_name        category  ratings  \
0  E8UIJIlW0Z5441VDegPA9Q      Pita Golden Pocket  Middle Eastern      4.5
1  5fg-RNWNbqyGn8b8wqe4QQ  168 Sushi Asian Buffet         Buffets      3.5
2  PQ6pDjHP0P28D3CY5UNxDA      Forget Me Not Cafe      Vietnamese      4.0
3  FJY3WbrP1UFPJaG_87kNdA   Hank Daddy's Barbecue        Southern      4.0
4  13ARujj003ytdue2yb6kRg             Thai Bamboo            Thai      3.5
5  sLxbYuDP41cMMCsov0ULOQ      Centre Street Deli           Delis      4.0
6  M3VcPBiMvhsEJSGUHvXu2w   Mustafa Turkish Pizza         Turkish      4.0
7  f0-KEhvOZeRx-Zfo6GoA_A          Sofra Istanbul   Mediterranean      4.0
8  5BFkc4QkZL3QCCL4nijleA         Pho Viet Xpress      Vietnamese      4.0
9  MXg7l-i--rIjHHPBUcw3gw              Meat Point         Turkish      4.5

   review_counts zip_code
0             90  L4K 2S9
1            265  L4K 3B9
2            104  M3K 1E6
3            131  L4K 1Y7
4            112  L4K 2Y7
5            122  L4J 3M8
6            135  M3K 1E6
7            108  L4K 1A2
8            146  L4J 2J6
9             49  M3K 1G6

In [31]:
# Use the pd.read_sql to query restaurant table and display the first 5 locations
restaurant_df = pd.read_sql("select * from restaurant", conn)
# Display the first 5 rows of the dataframe
restaurant_df.head()

,restaurant_id,category,restaurant_name,price_range,latitude,longitude,neighbourhood_id,neighbourhood_name
0,1,Afghan,The Host,$11-30,43.669935,-79.395858,95,annex
1,2,Afghan,Aanch Modernist Indian Cuisine,$11-30,43.644708,-79.390670,77,waterfront communities-the island
2,3,Afghan,Silk Road Kabob House,Under $10,43.659816,-79.385591,76,bay street corridor
3,4,Afghan,Naan & Kabob,$11-30,43.669058,-79.386100,75,church-yonge corridor
4,5,Afghan,Afghan Cuisine,$11-30,43.708070,-79.341508,55,thorncliffe park

In [32]:
yelp_ratings_df = pd.read_sql("select * from yelp_ratings", conn)
# Display the first 5 rows of the dataframe
yelp_ratings_df.head()

,restaurant_id,restaurant_name,category,ratings,review_counts,zip_code
0,E8UIJIlW0Z5441VDegPA9Q,Pita Golden Pocket,Middle Eastern,4.5,90,L4K 2S9
1,5fg-RNWNbqyGn8b8wqe4QQ,168 Sushi Asian Buffet,Buffets,3.5,265,L4K 3B9
2,PQ6pDjHP0P28D3CY5UNxDA,Forget Me Not Cafe,Vietnamese,4.0,104,M3K 1E6
3,FJY3WbrP1UFPJaG_87kNdA,Hank Daddy's Barbecue,Southern,4.0,131,L4K 1Y7
4,13ARujj003ytdue2yb6kRg,Thai Bamboo,Thai,3.5,112,L4K 2Y7

In [33]:
# Join the restaurant table and the yelp ratings table and display the head
restaurant_yelp_joined = pd.read_sql('select r.restaurant_name, r.category, r.price_range, y.ratings,\
y.review_counts, r.neighbourhood_id, r.neighbourhood_name \
FROM restaurant as r inner join yelp_ratings as y on r.restaurant_name = y.restaurant_name \
ORDER BY y.ratings DESC, y.review_counts DESC', conn)

restaurant_yelp_joined.head()

,restaurant_name,category,price_range,ratings,review_counts,neighbourhood_id,neighbourhood_name
0,Baretto Caffe,Cafes,Under $10,5.0,326,42,banbury-don mills
1,Zeal Burgers,Burgers,$11-30,5.0,117,113,weston
2,Pomarosa Coffee Shop & Kitchen,Cafes,$11-30,5.0,39,66,danforth
3,Wallace Espresso,Cafes,Under $10,5.0,36,93,dovercourt-wallace emerson-junction
4,Viva Shawarma,Mediterranean,Under $10,5.0,32,120,clairlea-birchmount

In [34]:
# Join the income table and the crime table and display the head
income_crime_data = pd.read_sql('select i.neighbourhood_id ,i.neighbourhood_name, i.average_income,\
c.total_average_crime_rate from income i inner join crime c on i.neighbourhood_id  = c.neighbourhood_id \
and i.neighbourhood_name = c.neighbourhood_name', conn)
income_crime_data.head()

,neighbourhood_id,neighbourhood_name,average_income,total_average_crime_rate
0,1,West Humber-Clairville,76228.0,507.32
1,2,Mount Olive-Silverstone-Jamestown,58605.0,232.13
2,3,Thistletown-Beaumond Heights,73512.0,236.50
3,4,Rexdale-Kipling,66781.0,245.35
4,5,Elms-Old Rexdale,63201.0,216.80